In [1]:
import numpy as np
import pandas as pd

In [2]:
arr = np.random.randint(0,6,(10,4))
df = pd.DataFrame(arr,
                 columns=list('ABCD'))
df

   A  B  C  D
0  5  2  1  5
1  3  2  1  0
2  1  5  3  0
3  2  4  4  0
4  3  1  1  5
5  4  4  4  3
6  2  3  2  4
7  4  5  0  3
8  5  5  2  1
9  4  1  4  2

In [7]:
df.groupby('A').mean()

          B         C         D
A
1  5.000000  3.000000  0.000000
2  3.500000  3.000000  2.000000
3  1.500000  1.000000  2.500000
4  3.333333  2.666667  2.666667
5  3.500000  1.500000  3.000000

In [8]:
df.groupby('A')

In [14]:
for d in df.groupby('A'):
    print(len(d), type(d[0]), type(d[1]))
    print(d[0]);
    print(d[1])
    print('');

2 <class 'int'> <class 'pandas.core.frame.DataFrame'>
1
   A  B  C  D
2  1  5  3  0

2 <class 'int'> <class 'pandas.core.frame.DataFrame'>
2
   A  B  C  D
3  2  4  4  0
6  2  3  2  4

2 <class 'int'> <class 'pandas.core.frame.DataFrame'>
3
   A  B  C  D
1  3  2  1  0
4  3  1  1  5

2 <class 'int'> <class 'pandas.core.frame.DataFrame'>
4
   A  B  C  D
5  4  4  4  3
7  4  5  0  3
9  4  1  4  2

2 <class 'int'> <class 'pandas.core.frame.DataFrame'>
5
   A  B  C  D
0  5  2  1  5
8  5  5  2  1

Hadley Wickham: groupby ~ split, apply, combine

In [18]:
df.groupby('A')[['B','C']].mean()

          B         C
A
1  5.000000  3.000000
2  3.500000  3.000000
3  1.500000  1.000000
4  3.333333  2.666667
5  3.500000  1.500000

In [20]:
for d in df.groupby(['A','B']):
    print(d);
    print("")

((1, 5),    A  B  C  D
2  1  5  3  0)

((2, 3),    A  B  C  D
6  2  3  2  4)

((2, 4),    A  B  C  D
3  2  4  4  0)

((3, 1),    A  B  C  D
4  3  1  1  5)

((3, 2),    A  B  C  D
1  3  2  1  0)

((4, 1),    A  B  C  D
9  4  1  4  2)

((4, 4),    A  B  C  D
5  4  4  4  3)

((4, 5),    A  B  C  D
7  4  5  0  3)

((5, 2),    A  B  C  D
0  5  2  1  5)

((5, 5),    A  B  C  D
8  5  5  2  1)

In [21]:
df.groupby(['A','B']).mean()

     C  D
A B
1 5  3  0
2 3  2  4
  4  4  0
3 1  1  5
  2  1  0
4 1  4  2
  4  4  3
  5  0  3
5 2  1  5
  5  2  1

In [23]:
df.groupby(['A','B']).mean().unstack()

     C                        D
B    1    2    3    4    5    1    2    3    4    5
A
1  NaN  NaN  NaN  NaN  3.0  NaN  NaN  NaN  NaN  0.0
2  NaN  NaN  2.0  4.0  NaN  NaN  NaN  4.0  0.0  NaN
3  1.0  1.0  NaN  NaN  NaN  5.0  0.0  NaN  NaN  NaN
4  4.0  NaN  NaN  4.0  0.0  2.0  NaN  NaN  3.0  3.0
5  NaN  1.0  NaN  NaN  2.0  NaN  5.0  NaN  NaN  1.0

`Groupby.filter()`, `Groupby.transform()`, `Groupby.apply()`

In [30]:
def f(x):
    return (x['B'].mean() > 2)

g = lambda x: x['B'].mean() > 2

df.groupby('A').filter(g)

   A  B  C  D
0  5  2  1  5
2  1  5  3  0
3  2  4  4  0
5  4  4  4  3
6  2  3  2  4
7  4  5  0  3
8  5  5  2  1
9  4  1  4  2

In [32]:
df.groupby('A').transform(lambda x: x-x.mean()) 
### transform happens for each **group** and each **column**

          B         C         D
0 -1.500000 -0.500000  2.000000
1  0.500000  0.000000 -2.500000
2  0.000000  0.000000  0.000000
3  0.500000  1.000000 -2.000000
4 -0.500000  0.000000  2.500000
5  0.666667  1.333333  0.333333
6 -0.500000 -1.000000  2.000000
7  1.666667 -2.666667  0.333333
8  1.500000  0.500000 -2.000000
9 -2.333333  1.333333 -0.666667

In [34]:
df.groupby('A').apply(lambda x: x[['B','C']])

   B  C
0  2  1
1  2  1
2  5  3
3  4  4
4  1  1
5  4  4
6  3  2
7  5  0
8  5  2
9  1  4

In [43]:
df.groupby(['A','B'])['C'].mean().unstack()

B    1    2    3    4    5
A
1  NaN  NaN  NaN  NaN  3.0
2  NaN  NaN  2.0  4.0  NaN
3  1.0  1.0  NaN  NaN  NaN
4  4.0  NaN  NaN  4.0  0.0
5  NaN  1.0  NaN  NaN  2.0

In [47]:
df.pivot_table('C', ### values
               index='A', 
               columns='B',
               aggfunc='mean' ### default value
              )

B    1    2    3    4    5
A
1  NaN  NaN  NaN  NaN  3.0
2  NaN  NaN  2.0  4.0  NaN
3  1.0  1.0  NaN  NaN  NaN
4  4.0  NaN  NaN  4.0  0.0
5  NaN  1.0  NaN  NaN  2.0

In [49]:
import seaborn as sns
### this is installed on CoCalc already
### pip install seaborn --user

In [50]:
data = sns.load_dataset('titanic')

In [53]:
print(data.shape)
print(data.columns)

(891, 15)
Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [54]:
data.groupby('sex')['survived'].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [56]:
(data['sex'] == 'female').sum()

314

In [59]:
data.pivot_table('survived', 
                index='sex', 
                columns='class',
                aggfunc='mean', 
                margins=True)

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838

In [58]:
data.pivot_table?